# Introduction
In this notebook, these packages are already imported:

- Numpy (imported as `np`)
- Pandas (imported as `pd`)
- Matplotlib.Pyplot (imported as `plt`)
- [Dask.Array](https://docs.dask.org/en/latest/array.html) (imported as `da`)
- [Dask.Dataframe](https://docs.dask.org/en/latest/dataframe.html) (imported as `dd`)

More packages are also available, but you need to import them first if you want to use them.

Some of them are: Scikit-Learn (`sklearn`)

This is your profile. You have to run this first before using your file from KolaDrive.

In [1]:
profile = { "user_id": "8b2cf4b3-5e04-47ae-838a-574bf343cc72", "organization_id": "a91a117d-2da8-4a07-b2bf-d9585494c106", "parent_id": "4b8dd4aa-9101-48a9-bddc-bc366ff8d088" }

### How to read data from KolaDrive
You can read data from KolaDrive, by using following function:

#### `read_csv(id="<file_id>")` -> read csv file (type: dask dataframe)
Parameters:
* `id` -> file id (type: uuid, required)

Example:

``` python
df = read_csv(id='00000000-0000-0000-0000-000000000000')
df.head(5)
```

#### `read_xls(id="<file_id>")` -> read excel file (type: dask dataframe)
Parameters:
* `id` -> file id (type: uuid, required)

Example:

``` python
df = read_xls(id='00000000-0000-0000-0000-000000000000')
df.head(5)
```

### How to write data to KolaDrive
You can write data to KolaDrive, by using following function:

#### `write_csv(dataframe=<dataframe>, name="<file_name>", id="<random_generated_uuid")` -> write csv file
Parameters:
* `dataframe` -> a dataframe (type: dask dataframe, required)

* `name` -> file name (type: string, optional, default: `Untitled File`)

* `id` -> file id (type: uuid, optional, default: `None`). `None` means the id would be randomly generated. Write some ID here will affect output file always overwritten.

``` python
df = read_csv(id='00000000-0000-0000-0000-000000000000')
write_csv(df, name='Just Another CSV')
write_csv(df, name='Overwritten CSV', id='ffffffff-ffff-ffff-ffff-ffffffffffff')
```



For getting your file's id, check it on mydata, right-click on the file, then select info.

## Installing pandas

```conda install pandas```
ref: https://pandas.pydata.org/docs/getting_started/install.html

## Installing Dask
```conda install dask```
ref: https://docs.dask.org/en/latest/install.html

## Installing Pyspark
```conda install pyspark```
refs: https://spark.apache.org/docs/latest/api/python/getting_started/install.html, https://pypi.org/project/pyspark/

In [1]:
import pandas as pd
import dask.array as da
import dask.dataframe as dd
import numpy as np
import matplotlib.pyplot as plt

## Topic: Do Spreadsheet
Apa yang dimaksud "Do Spreadsheet"?

DataFrame: Sebuah objek, isinya data yang disusun seperti tabel/spreadsheet atau file sql atau csv.

Pada data science, dataframe adalah objek yang berisi data yang telah terstruktur dalam tabel, seperti SQL atau CSV. Keberadaan objek di dalam python ini mempermudah pengolahan data.

Ada 3 jenis datafreme yang umum dikenal di dalam python:
- pandas
- dask
- spark

Pandas paling simple implementasi, tapi resource demandnya (CPU & RAM) cukup intensive.
Spark paling cepat, tapi resource intensive
Dask untuk distributed computing, penggunaan resourcenya bisa lebih fleksibel karena beban komputasi dapat dibagi-bagi.

In [5]:
# Membuat pandas dataframe
df2 = pd.DataFrame()
df2['col_1'] = [1,2,3,4,5,6,7]
df2['col_2'] = [1,2,3,4,5,6,7]
df2['col_3'] = [1,2,3,4,5,6,7]

In [6]:
type(df2)

pandas.core.frame.DataFrame

In [8]:
# Membuat Dask dataframe
## Pertama buat Pandas dataframe, lalu diubah menjadi Dask
ddf = dd.from_pandas(df2, npartitions=5)
ddf.head()

/home/tb/anaconda3/envs/Ngoding1/lib/python3.9/site-packages/dask/dataframe/core.py:6774: UserWarning: Insufficient elements for `head`. 5 elements requested, only 2 elements available. Try passing larger `npartitions` to `head`.
  warnings.warn(msg.format(n, len(r)))

   col_1  col_2  col_3
0      1      1      1
1      2      2      2

In [9]:
type(ddf)

dask.dataframe.core.DataFrame

In [10]:
# Cara buat dataframe kosong
pdf = pd.DataFrame()
pdf.head()

Empty DataFrame
Columns: []
Index: []

In [11]:
# Cara mengisi dataframe
## nama_dataframe['nama_kolom'] = [item1, item2, item3]
## menambahkan kolom baru
pdf['col_1'] = [1,2,3,4,5]
pdf.head()

   col_1
0      1
1      2
2      3
3      4
4      5

In [12]:
# Menambah kolom baru 
pdf['col_2'] = [1,2,3,4,5]
pdf.head()

   col_1  col_2
0      1      1
1      2      2
2      3      3
3      4      4
4      5      5

In [13]:
# Membuat kolom baru dengan menggunakan data pada kolom yang sudah ada
pdf['col_3'] = pdf['col_1']**2
pdf.head()

   col_1  col_2  col_3
0      1      1      1
1      2      2      4
2      3      3      9
3      4      4     16
4      5      5     25

In [14]:
pdf['col_4'] = pdf['col_1'] + pdf['col_2']
pdf.head()

   col_1  col_2  col_3  col_4
0      1      1      1      2
1      2      2      4      4
2      3      3      9      6
3      4      4     16      8
4      5      5     25     10

In [15]:
ddf = dd.from_pandas(pdf, npartitions=1)
ddf.head()

   col_1  col_2  col_3  col_4
0      1      1      1      2
1      2      2      4      4
2      3      3      9      6
3      4      4     16      8
4      5      5     25     10

In [17]:
print(type(ddf))

<class 'dask.dataframe.core.DataFrame'>

In [18]:
# Menambah kolom pada dataframe Dask, harus dengan array. Karena pada Dask, urutan data bisa berubah (urutan tidak penting).
## Dusk pakai numpy
ddf['col_2'] = dd.from_array(np.array([2, 2, 2, 2, 2]))
ddf.head()

   col_1  col_2  col_3  col_4
0      1      2      1      2
1      2      2      4      4
2      3      2      9      6
3      4      2     16      8
4      5      2     25     10

In [19]:
# Menambah kolom di Dask dengan dari kolom lainnya dengan operasi sederhana
ddf['col_3'] = ddf['col_1']**2
ddf.head()

   col_1  col_2  col_3  col_4
0      1      2      1      2
1      2      2      4      4
2      3      2      9      6
3      4      2     16      8
4      5      2     25     10

In [20]:
ddf['col_5'] = ddf['col_1'] + ddf['col_2'] / ddf['col_3']
ddf.head()

   col_1  col_2  col_3  col_4     col_5
0      1      2      1      2  3.000000
1      2      2      4      4  2.500000
2      3      2      9      6  3.222222
3      4      2     16      8  4.125000
4      5      2     25     10  5.080000

In [21]:
# Cek tipe data
pdf.dtypes

col_1    int64
col_2    int64
col_3    int64
col_4    int64
dtype: object

In [22]:
ddf.dtypes

col_1      int64
col_2      int64
col_3      int64
col_4      int64
col_5    float64
dtype: object

In [23]:
# Mengubah tipe data satu kolom
## Pandas
pdf.dtypes

col_1    int64
col_2    int64
col_3    int64
col_4    int64
dtype: object

In [24]:
pdf['col_4'] = pdf['col_4'].astype(str)
pdf.dtypes

col_1     int64
col_2     int64
col_3     int64
col_4    object
dtype: object

In [25]:
pdf['col_3'] = pdf['col_3'].astype(str)
pdf.dtypes

col_1     int64
col_2     int64
col_3    object
col_4    object
dtype: object

In [26]:
pdf['col_6'] = pdf['col_4'] + pdf['col_3']
pdf.dtypes

col_1     int64
col_2     int64
col_3    object
col_4    object
col_6    object
dtype: object

In [27]:
pdf.head()

   col_1  col_2 col_3 col_4 col_6
0      1      1     1     2    21
1      2      2     4     4    44
2      3      3     9     6    69
3      4      4    16     8   816
4      5      5    25    10  1025

In [28]:
## Dask
ddf.dtypes

col_1      int64
col_2      int64
col_3      int64
col_4      int64
col_5    float64
dtype: object

In [29]:
ddf['col_3'] = ddf['col_3'].astype(str)
ddf.dtypes

col_1      int64
col_2      int64
col_3     object
col_4      int64
col_5    float64
dtype: object

In [30]:
# Menampilkan sebagian dataframe
ddf.tail(2)

   col_1  col_2 col_3  col_4  col_5
3      4      2    16      8  4.125
4      5      2    25     10  5.080

In [31]:
ddf.head(2)

   col_1  col_2 col_3  col_4  col_5
0      1      2     1      2    3.0
1      2      2     4      4    2.5

In [32]:
# Mengambil data dari dataframe
pdf.head()

   col_1  col_2 col_3 col_4 col_6
0      1      1     1     2    21
1      2      2     4     4    44
2      3      3     9     6    69
3      4      4    16     8   816
4      5      5    25    10  1025

In [33]:
col_2 = list(pdf['col_2'])
col_2

[1, 2, 3, 4, 5]

In [34]:
col_5 = list(ddf['col_5'])
col_5

[3.0, 2.5, 3.2222222222222223, 4.125, 5.08]

In [35]:
# Pada Dask, urutan bisa berubah! Karena partisinya bisa berubah-ubah
# Mengubah dari dataframe Dask ke Pandas
pdf2 = ddf.compute() #mengeksekusi operasi-operasi yang telah dibukukan. 
# compute() untuk membuat dataframe yang isinya tetap/permanen, mengubah Dask menjadi Pandas
type(pdf2)

pandas.core.frame.DataFrame

In [36]:
# Dask dataframe [nama, umur]
# Di compute dahulu (convert to pandas)
# nama = list(ddf['nama'])
# umur = list(ddf['umur']) --> urutan nama dan umur bisa berubah atau acak, bila tidak di compute

In [37]:
# Sorting di dask
ddfz = ddf.nlargest(len(ddf), 'col_1')
ddfz.head()

   col_1  col_2 col_3  col_4     col_5
4      5      2    25     10  5.080000
3      4      2    16      8  4.125000
2      3      2     9      6  3.222222
1      2      2     4      4  2.500000
0      1      2     1      2  3.000000

In [38]:
# Max, min, pada dataframe

## Pandas
max(list(pdf['col_1'])) #pada Dask code operasinya juga sama

5

In [40]:
## Dask
max(list(ddf['col_1'])) #pada Dask code operasinya juga sama

5

In [41]:
# Cek nama kolom
## Pandas
list(pdf.columns)

['col_1', 'col_2', 'col_3', 'col_4', 'col_6']

In [42]:
## Dask
list(ddf.columns)

['col_1', 'col_2', 'col_3', 'col_4', 'col_5']

In [43]:
# Mengubah nama kolom
## Pandas
pdf = pdf.rename(columns={
    'col_1':'A', 'col_2':'B'
    
})
pdf.head()

   A  B col_3 col_4 col_6
0  1  1     1     2    21
1  2  2     4     4    44
2  3  3     9     6    69
3  4  4    16     8   816
4  5  5    25    10  1025

In [44]:
## Dask
ddf = ddf.rename(columns={
    'col_1':'A', 'col_2':'B'
    
})
ddf.head()

   A  B col_3  col_4     col_5
0  1  2     1      2  3.000000
1  2  2     4      4  2.500000
2  3  2     9      6  3.222222
3  4  2    16      8  4.125000
4  5  2    25     10  5.080000

In [48]:
# Undo

pdf = pdf.rename(columns={
    'A':'col_1', 'B':'col_2'
    
})
pdf.head()

ddf = ddf.rename(columns={
    'A':'col_1', 'B':'col_2'
    
})
ddf.head()

   col_1  col_2 col_3  col_4     col_5
0      1      2     1      2  3.000000
1      2      2     4      4  2.500000
2      3      2     9      6  3.222222
3      4      2    16      8  4.125000
4      5      2    25     10  5.080000

In [51]:
## Cara lain untuk mengubah nama kolom di Pandas
pdf.columns = ['A','B','C','D','E']
pdf.head()

   A  B   C   D     E
0  1  1   1   2    21
1  2  2   4   4    44
2  3  3   9   6    69
3  4  4  16   8   816
4  5  5  25  10  1025

In [49]:
## Cara lain di Dask
ddf.columns = ['A','B','C','D','E']
ddf.head()

   A  B   C   D         E
0  1  2   1   2  3.000000
1  2  2   4   4  2.500000
2  3  2   9   6  3.222222
3  4  2  16   8  4.125000
4  5  2  25  10  5.080000

In [52]:
# Filter
## Pandas

pdf2 = pdf[pdf['A']==2]
pdf2.head()

   A  B  C  D   E
1  2  2  4  4  44

In [53]:
## Dask

ddf2 = ddf[ddf['A']==2]
ddf2.head()

/home/tb/anaconda3/envs/Ngoding1/lib/python3.9/site-packages/dask/dataframe/core.py:6774: UserWarning: Insufficient elements for `head`. 5 elements requested, only 1 elements available. Try passing larger `npartitions` to `head`.
  warnings.warn(msg.format(n, len(r)))

   A  B  C  D    E
1  2  2  4  4  2.5

In [54]:
## Pandas

pdf2 = pdf[pdf['A']==2 | (pdf['D'].item in [2,3])] # filter data: A == 2 or D == 2 or D == 3
pdf2.head()

   A  B  C  D   E
1  2  2  4  4  44

In [55]:
pdf3 = pdf[pdf['A']== 1 | (pdf['D'] == 4)]
pdf3.head()

   A  B  C  D   E
0  1  1  1  2  21

In [56]:
# Pada Dask, code operasi filteringnya juga sama
ddf

Dask DataFrame Structure:
                   A      B       C      D        E
npartitions=1
0              int64  int64  object  int64  float64
4                ...    ...     ...    ...      ...
Dask Name: rename, 19 tasks

In [57]:
ddf3 = ddf[ddf['A']== 1 | (ddf['D'] == 4)]
ddf3.head()

/home/tb/anaconda3/envs/Ngoding1/lib/python3.9/site-packages/dask/dataframe/core.py:6774: UserWarning: Insufficient elements for `head`. 5 elements requested, only 1 elements available. Try passing larger `npartitions` to `head`.
  warnings.warn(msg.format(n, len(r)))

   A  B  C  D    E
0  1  2  1  2  3.0

In [58]:
pdf2 = pdf[['A','C']]
pdf2.head()

   A   C
0  1   1
1  2   4
2  3   9
3  4  16
4  5  25

In [59]:
## Gerbang logika
# or |
# and &
# not !=